<?php $__env->startSection('title'); ?>文档中心 - <?php $__env->stopSection(); ?>

<?php $__env->startSection('page-assets'); ?>
<link rel="stylesheet" href="<?php echo e(asset('assets/pages/doc/agreement/page.css')); ?>">
<?php $__env->stopSection(); ?>

<?php $__env->startSection('document-content'); ?>
<h2 class="border">平台服务协议</h2>

<div class="agreement-content">
    <h3>定义</h3>
    <p>
        如无特别说明，下列术语在本协议中的含义为：
    </p>
    <p>
        1.1 开发者，指经有效申请并经过金桐网投资有限公司同意，将其开发的各种应用接入基于金桐开放平台而向用户提供各种服务的，具备民事行为能力的个人、法人或其他组织。如无特别说明，也称“第三方”。
    </p>
    <p>
        1.2 应用，指由开发者开发的可向用户提供各种服务的应用程序，包括但不限于工具类服务、电子商务类服务、视频或音乐类服务等现存的各种服务及今后可能出现的各种服务，也称“授权程序”。
    </p>
    <p>
        1.3 网站，指由开发者开发的可向用户提供各种服务的网站，包括但不限于工具类服务、电子商务类服务、视频或音乐类服务等现存的各种服务及今后可能出现的各种服务，也称“授权网站”。
    </p>
    <p>
        1.4金桐开放平台，指由北京金桐网投资有限公司所拥有、控制、经营的开放平台。
    </p>
    <p>
        1.5金桐开放平台用户，指所有直接或间接使用金桐开放平台上授权应用和授权网站的企业或个人。以下简称为“用户”。
    </p>
    <p>
        1.6 用户数据，是指用户通过金桐开放平台提交的或因用户访问开放平台而生成的数据。“用户数据”是金桐开放平台的商业秘密。
    </p>
    <p>
        1.7 平台运营数据，是指在用户通过金桐开放平台使用平台服务、授权网站、开发者应用期间，用户所提交的或在金桐开放平台生成的或在授权网站和开发者应用生成的任何数据或信息，包括但不限于用户登录数据，交易数据等数据。“平台运营数据”是金桐开放的商业秘密。双方确认，平台运营数据和用户数据统称“数据”。
    </p>

    <h3>开放者的权利和义务</h3>

    <p>
        2.1 开发者保证：对开发者在金桐开放平台发布的应用、授权网站及利用金桐开放平台实施的活动真实、准确、完整、安全；不存在任何欺诈成份，不侵犯任何组织或个人的合法权益；不违反任何法律、法规、条例或规章；符合金桐开放的各项规范、规则及制度。对于开发者行为所造成的任何法律责任，由开发者单独承担，若由此给金桐公司及其关联公司造成任何损失，则开发者需足额赔偿。
    </p>
    <p>
        2.2 与金桐公司开展合作的开发者，其行为受本协议及金桐开放平台规则及金桐开放平台上公示的规则、制度、规范的约束。开发者必须合法使用金桐公司授予其应用的AppKey，不得违反本协议宗旨将该AppKey用于其他任何目的。AppKey是第三方应用接入金桐开放平台的凭证，开发者应当妥善保管AppKey及其密码，不得授权任何第三人使用其AppKey，并就该AppKey项下之一切活动负全部责任。因AppKey的使用行为导致金桐公司遭受损失的，开发者需足额赔偿。
    </p>
    <p>
        2.3 开发者应当具备从事本协议项下应用开发或提供服务的相关资质，开发者应当具备履行其基于本协议项下之义务的能力，且开发者履行相关义务不违反任何对开发者有约束力的法律文件，第三方开发应用或提供服务的具体资质和能力要求请参见《审核指南与流程》。
    </p>
    <p>
        2.4 开发者在其应用、授权网站设计上应当重视用户体验，尊重用户知情权、选择权，应用、网站应当坚持诚信原则，不误导、欺诈、混淆用户，尊重用户的隐私，不骚扰用户，不制造垃圾信息。
    </p>
    <p>
        2.5 开发者应用或服务需要收集用户数据的应当符合以下条件：
    </p>
    <p>
        2.5.1 开发者应用或服务需要收集用户数据的，必须事先获得用户的同意，且仅应当收集为应用程序运行及功能实现目的而必要的用户数据和用户在授权网站或开发者应用生成的数据或信息。开发者应当告知用户相关数据收集的目的、范围及使用方式，以保障用户的知情权；
    </p>
    <p>
        2.5.2 开发者应当就应用向金桐开放平台用户提供隐私保护政策，告知金桐开放平台用户该应用收集哪些用户数据，如何使用，是否会将用户数据传播或提交给他人等，以保障用户的知情权及选择权。隐私政策在应用的界面上应当显示给金桐开放平台用户。
    </p>
    <p>
        2.5.2 金桐开放平台各类数据均不能以政府舆情监控或类似理由申请，如确有该方面需要，需持相关委托函原件申请开通。
    </p>
    <p>
        2.5.4 开发者应当向用户提供修改、删除用户数据的方式，确保用户要求删除其用户数据时可通过该方式自行操作完成，并确保相关数据被完全删除；
    </p>
    <p>
        2.5.5 未经用户同意，开发者不得收集用户的隐私信息数据及其他金桐公司认为属于敏感信息范畴的数据；开发者不得收集或要求用户提供任何金桐开放帐号、密码；开发者不得收集或要求用户提供用户关系链、好友列表数据等；
    </p>
    <p>
        2.5.6 开发者不得以任何方式将用户数据给第三人，开发者在特定应用或服务中收集到的用户数据仅可以在该特定应用或服务中使用，不得以任何方式将收集到的用户数据转移或使用在该特定应用或服务之外。
    </p>
    <p>
        2.5.7 开发者应当仅获取为应用或服务运行及功能实现目的而必要的数据；
    </p>
    <p>
        2.5.8 开发者未经授权不得使用平台数据用于向金桐开放平台用户进行广告宣传使用；
    </p>
    <p>
        2.5.9 开发者不得私自以任何形式将平台数据提供给任何其他第三人使用；
    </p>
    <p>
        2.5.10 如果金桐公司认为开发者使用用户数据的方式，会损害金桐开放平台用户体验，金桐公司有权要求开发者删除相关数据并不得再以该方式使用用户数据。
    </p>
    <p>
        2.5.11 金桐公司有权限制或阻止开发者获取用户数据及平台数据。
    </p>
    <p>
        2.5.12 开发者应当遵守金桐公司关于用户数据的其他管理规则。
    </p>
    <p>
        2.5.13 金桐开放开放平台运营数据的全部权利，均归属金桐公司。未经金桐公司事先书面同意，开发者不得为本协议约定目的外使用该运营数据。
    </p>
    <p>
        2.5.14 开发者对外向合作伙伴提供应用运营数据，必须经金桐公司的书面同意，并使用金桐公司允许其使用的数据。
    </p>
    <p>
        2.5.15 一旦开发者停止使用开放平台或金桐公司基于任何原因终止对开发者在金桐开放开放平台的服务，开发者必须立即删除全部从金桐开放开放平台中获得的数据。
    </p>
    <p>
        2.5.16 开发者应当向用户提供客服支持，并提供有效联系方式确保用户可以进行投诉和咨询。
    </p>
    <p>
        2.6 开发者应就其应用及相关服务，事先向金桐开放平台用户提供其用户服务协议。该用户服务协议中应当明确其应用及相关服务由开发者向用户提供并由开发者对用户负责。若开发者未按要求向金桐公司提交，则视为开发者同意使用金桐公司提供的统一模板。基于该应用开发者与金桐开放平台用户之间发生的纠纷应当由开发者与金桐开放平台用户协商解决，与金桐公司无关。
    </p>
    <p>
        2.7 金桐开放平台的规则
    </p>
    <p>
        2.7.1 开发者不得在应用内宣传与本应用无关的任何其他信息，包括但不限于广告、其他的应用产品信息等。
    </p>
    <p>
        2.7.2 在没有获得金桐开放平台用户明示同意的情况下，开发者不得直接联系金桐开放平台用户，或向金桐开放平台用户发布任何商业广告及骚扰信息。
    </p>
    <p>
        2.7.3 未经另行书面许可，开发者不得使用金桐公司及其关联公司的任何商业标识；
    </p>
    <p>
        开发者不得模仿使用金桐公司及其关联公司的的任何标识，亦不得使用与上述标识近似的标识，以免造成用户混淆；
    </p>
    <p>
        开发者应当遵守开放平台的标识规则及界面设计规则，金桐公司认为开发者的标识有可能造成用户混淆的，有权基于自身独立判断要求开发者修改。开发者不予配合的，金桐公司有权暂停或终止为其提供服务。
    </p>
    <p>
        2.7.4 开发者不得公开表达或暗示，开发者与金桐公司之间存在合作关系，包括但不限于相互持股、商业往来或合作关系等，或声称金桐公司对开发者的认可、授权。
    </p>
    <p>
        2.7.5 开发者上传的应用内容应当符合法律规定，开发者对其上传的应用负全部责任。
    </p>
    <p>
        2.7.6 开发者拥有依照本协议约定合法使用金桐开放平台开放API的权利；开发者不得向任何第三人赠与、出售、转让或转授权金桐公司的代码、API及开发工具等；
    </p>
    <p>
        2.7.7 开发者通过开放API获得的数据仅可服务于接入应用或网站，不得用于其它任何用途；
    </p>
    <p>
        2.7.8 业务范围为数据采集、分析并服务于其他第三方的开发者，仅可通过金桐开放商业数据API进行相关工作，同时签订《商业数据服务合作协议》；
    </p>
    <p>
        2.7.9 开发者负责其应用及服务的创作、开发、编辑、加工、修改、测试、运营及维护，并且自行承担相应的成本。
    </p>
    <p>
        2.7.10 未经金桐公司书面许可，在应用和服务运营过程中，开发者不得通过包括但不限于赠送、发售等方式使用金桐公司的任何虚拟货币或增值服务等；开发者不得通过包括但不限于赠送、发售等方式使用和金桐公司有直接竞争关系的公司的虚拟货币（包括但不限于其他网站购物消费券、其他网站购物虚拟红包）或品牌服务等，如因开发者违反上述条款给用户或金桐公司造成任何损失的，开发者应当赔偿损失，并承担相应的法律责任。
    </p>
    <p>
        2.8 开发者上传应用应当承担以下责任
    </p>
    <p>
        2.8.1 开发者在发布应用或服务及对应用或服务进行编辑、修改和更新前应经金桐公司书面确认。若开发者未经金桐公司书面确认擅自对应用进行编辑、修改和更新的，金桐公司有权单方面解除本协议关系，协议解除后，造成金桐公司及相关用户损失的，开发者应予赔偿。
    </p>
    <p>
        2.8.2 开发者保证其上传给金桐开放平台的应用和提供给用户的相关服务，不违反当地相关法律、法规、政策的规定；不涉及有损中华人民共和国国家安全和利益的信息；也不涉及任何反动、色情、迷信、赌博、诽谤他人等违法信息；且不会侵犯任何人的合法权益，包括但不限于知识产权、名誉权、肖像权、商业秘密等。开发者因违反上述条款所引起的纠纷、赔偿责任等一律由开发者自行承担，若由此给金桐公司造成损失的，开发者应当承担赔偿责任。如开发者需使用金桐公司及其关联公司享有的知识产权，应得到金桐开放的书面许可，且不得以任何方式泄露给他人，亦不得用于本协议约定外的任何用途。
    </p>
    <p>
        开发者提供的应用及服务存在上述情况的，金桐公司有权根据自己的判断，随时单方暂停或终止与开发者的合作，由此给用户及开发者造成的损失，开发者应自行承担。
    </p>
    <p>
        2.8.3 开发者保证在授权程序和服务的运营过程中，由用户使用应用或服务产生的内容，包括但不限于留言、消息、评论、名称等，不违反授权区域法律、法规、政策的规定，不涉及有损中华人民共和国国家安全和利益的信息，也不涉及任何反动、色情、迷信、赌博、诽谤他人、侵权等违法信息，若有上述情形出现，开发者会及时删除或其采取他合理措施。开发者违反本条款所引起的任何争议、处罚和其他法律责任等，由其自行承担责任，给金桐公司造成损失的，开发者应予以足额赔偿。
    </p>
    <p>
        2.8.4 因金桐开放平台运营的实际情况需求，金桐公司可能额外要求开发者增加或修改应用特性或参与运营活动，开发者同意配合且金桐公司无需为此向开发者支付任何费用。
    </p>
    <p>
        2.8.5 开发者同意按照金桐公司的要求，对其应用进行必要的解释与批注（包括但不限于应用名称、主题、应用分类等）。
    </p>
    <p>
        2.8.6 开发者保证，其应用不得直接或间接从事下列行为：
    </p>
    <p>
        （1）删除、隐匿、改变金桐网及金桐开放平台显示或包含的任何专利、版权、商标或其他所有权益声明；
    </p>
    <p>
        （2）过滤掉或不显示timeline接口输出的推广内容；
    </p>
    <p>
        （3）以任何方式干扰或企图干扰金桐公司及其关联公司旗下任何网站任何部分、任何功能的正常运行；
    </p>
    <p>
        （4）包括但不限于在应用中使用与“金桐网” 、“金桐开放”等金桐公司产品同名或任何变体、缩写、改写、增减文字或字母或错误拼写等的字眼；
    </p>
    <p>
        （5）避开、尝试避开或声称能够避开任何内容保护机制或者金桐公司所提供的数据度量工具，并由此导致用户认为其直接与金桐网、金桐开放平台或金桐旗下相关产品进行交互；
    </p>
    <p>
        （6）在未获得金桐公司及其关联公司书面许可的情况下，以任何方式公开使用其标志、URL地址或其他标识等；
    </p>
    <p>
        （7）在未经过用户同意的情况下，向任何其他用户或第三人显示或以其他任何方式提供该用户的任何信息；
    </p>
    <p>
        （8）请求、收集、索取或以其他方式获取用户帐号、密码或其他任何身份验证凭据，包括但不限于金桐开放帐号、邮箱地址、金桐公众号等；
    </p>
    <p>
        （9）为任何最终用户自动登录到金桐开放平台提供代理身份验证凭据；
    </p>
    <p>
        （10）提供跟踪功能，包括但不限于识别其他用户在个人主页上的查看、点击等操作行为；
    </p>
    <p>
        （11）自动将应用或服务窗口定向到其他网页；
    </p>
    <p>
        （12）未经授权获取对金桐开放平台的访问权
    </p>
    <p>
        开发者违反上述条款的，金桐公司有权根据其情节，对开发者做出警告、限制服务、关闭应用入口、终止服务等处理。开发者需负责赔偿因开发者违反上述任何条款而给用户、金桐公司或金桐公司的任何合作伙伴、关联企业所造成的一切损失。
    </p>
    <p>
        2.8.7 开发者应用在开放平台上运行期间，开发者需向用户提供与应用相关的客户服务并保证服务质量。客户服务形式包括但不限于通过明确且合理的方式告知用户客户服务渠道、提供即时通讯方式、电话等，且此客户服务的成本由开发者承担。若因客户服务侵害到他人权益并给他人造成损失的，则开发者应承担全部责任；如侵害到金桐公司权益并给金桐公司造成损失，则开发者应承担回复声誉的责任，并足额赔偿由此给金桐公司造成的一切损失。
    </p>
    <p>
        2.8.8 开发者应用或服务使用金桐公司提供的服务器环境，由此产生的所有费用（包括但不限于服务器、带宽成本）由开发者承担。
    </p>
    <p>
        2.9 开发者不应当以任何形式上传或使用存在侵权或违反法律法规规定的内容、应用、服务或程序。金桐公司有权基于自身判断将违背本协议约定/有侵权嫌疑的内容、应用、服务或程序做删除处理，开发者对上述处理方式有异议的，可以联系金桐公司并提供异议理由及相关证据。如果开发者多次上传侵权内容、应用、服务或程序的，金桐公司有权单方面决定停止向该开发者提供服务，并删除其开发者帐户。
    </p>
    <p>
        2.10 开发者同意接收来自金桐公司及其关联公司或合作伙伴发出的邮件、信息，包括但不限于关于用户利益、商业推广的信息等；开发者如需向金桐公司进行通知，应当通过金桐公司对外正式公布的通信地址、电子邮件地址等联系信息送达；开发者联系用户时应当使用其在应用界面中展示的统一的服务邮件地址。
    </p>
    <p>
        2.11 若因开发者的原因导致其提供的应用或服务需要终止的，开发者应当在终止之前提前90日通知金桐公司，且开发者应当在终止应用或终止服务前60日内在应用页面及服务页面中，向使用应用或享受服务的相关金桐开放平台用户发布公告通知。金桐开放平台用户在开发者应用中享有的相关权益，开发者必须妥善处理，包括但不限于对尚未使用的相关费用予以退还或补偿；对尚未使用的属于游戏类应用的游戏币及尚未失效的游戏服务，应当按用户支付购买时的比例，以法定货币形式退还用户或者以用户接受的其他方式进行退换。因开发者终止应用或服务产生的纠纷由开发者独自负责解决。
    </p>

    <h3>金桐公司的权利和义务</h3>

    <p>
        3.1 金桐公司有权审查开发者是否具备合法的经营资格、业务资质和服务能力。
    </p>
    <p>
        开发者在其应用或服务发布之前，金桐公司有权针对市场的需求、应用的质量、内容与版权的合法性、健康性、与金桐开放平台特点的结合性等方面，对应用进行评审，金桐公司有权依据其自身判断决定是否同意发布该应用或服务。
    </p>
    <p>
        开发者发布其应用或服务后，金桐公司有权不定时对开发者发布的应用或服务进行审核，如发现开发者违反本协议约定、违反任何法律法规或金桐公司根据自己的独立判断认为应用或服务不符合金桐公司要求或平台用户的需求的，金桐公司有权在不通知的情况下对其予以删除或屏蔽。
    </p>
    <p>
        对于经金桐公司审核通过的应用或服务，金桐公司可以在其各种平台上向金桐公司的平台用户提供和运营，具体的平台由金桐公司根据情况独立决定，同时，开发者应根据金桐公司的要求向金桐公司提供与应用或服务相关的源代码、目标代码及其他必要资料等，金桐公司有权根据实际需要对开发者提供的前述相关代码、资料进行必要的修改或更新，且无需提前通知开发者。开发者应根据金桐公司的要求与金桐公司就具体事项进行磋商并签订书面合同。
    </p>
    <p>
        金桐公司有权为任何目的分析使用开发者的应用或服务，包括但不限于应用程序代码、应用内容、应用中的数据等。金桐公司有权对开发者的应用或服务进行全面的安全审查。
    </p>
    <p>
        金桐公司有权开发使用与开发者应用或服务功能相似或相竞争的应用或服务，同时金桐公司也不保证其开放式平台上不会出现其他开发者提供的与开发者应用功能相似或相竞争的应用或服务。
    </p>
    <p>
        拟在金桐平台上线的应用或服务，须区别于该应用或服务在其他任何平台上的名称，否则，金桐公司有权要求拒绝其在金桐平台上线的请求。
    </p>
    <p>
        金桐公司可针对市场或者推广的需求，及上线后的具体运营情况，对已上线的应用或服务向开发者提出新特性、新接口开的发需求或现有逻辑、特性、接口的修改需求；开发者拒绝配合的，金桐公司有权要求开发者给出书面非合理解释。如果开发者多次拒绝配合且没有给出任何合理理由，金桐公司有权单方面决定将应用或服务下线或者终止合作。
    </p>
    <p>
        3.2 金桐公司及其关联公司拥有合作过程中涉及到的金桐品牌和所有应用及服务内容知识产权，以及上述金桐品牌、知识产权在合作过程中产生的衍生品的全部合法权益。
    </p>
    <p>
        如开发者在应用的开发、制作中，经金桐公司或其关联公司书面许可后使用了其知识产权，则所涉及内容的知识产权仍归属于金桐公司或其关联公司所有，并且金桐有权就已经开发完成的所有内容进行相关权利的申请。
    </p>
    <p>
        开发者创建应用后，90天未提交审核，金桐公司有权收回该应用；对于提交并通过审核的应用，如持有应用名称相关商标资质的公司或个人要求使用该应用名称，金桐公司有权将应用转移给持有该应用名称商标资质的公司或个人。
    </p>
    <p>
        3.3 金桐公司拥有通过使用合作服务所带来的所有用户数据的所有权。金桐公司有权知悉开发者应用及其应用用户的注册数据、交易数据及其他运营数据，如发现注册数据或交易行为中存在任何问题，金桐公司有权要求开发者改正，或者直接作出删除、屏蔽等处理。
    </p>
    <p>
        金桐公司有权在金桐开放平台上通过多种形式，包括但不限于应用介绍、服务介绍等，向用户阐述该应用由开发者开发并由该开发者向用户提供客户服务等。
    </p>
    <p>
        金桐公司有权在包括但不限于金桐开放平台上进行相关应用推广活动或宣传。
    </p>
    <p>
        3.4 开发者因违反相关法律法规而被取缔运营，或因违规操作被网络监管部门查封所引发的全部责任，由开发者独立承担。情节严重并给金桐公司及其关联公司带来不利影响的，开发者须赔偿其所有损失，并负责恢复声誉，此情况下金桐公司有权单方终止本协议。
    </p>
    <p>
        如发现开发者有违法行为，或其提供的应用中包含违法信息或可能侵犯他人合法权益的信息，无论是否已造成不良后果，金桐公司均有权要求开发者立即停止违法行为或更换、修改违法内容，或者单方终止本服务协议，并且有权要求开发者赔偿由此给金桐造成的损失。
    </p>
    <p>
        3.5 如发生下列任一情形，金桐公司有权以普通或非专业人员的知识水平标准对相关内容进行判别，如认为这些内容或行为具有不合理或违法的情形，金桐公司有权删除相关信息，或终止或暂停对该开发者提供服务。
    </p>
    <p>
        （1）其他第三方对某个开发者或具体事项持有异议并书面通知金桐公司的；
    </p>
    <p>
        （2）其他第三方向金桐公司书面告知金桐开放平台上有违法或不当情形的。
    </p>
    <p>
        （3）第三方使用金桐运营数据与金桐形成不正当竞争关系的。
    </p>
    <p>
        3.6 金桐公司可将本协议下的权利和义务的部分或全部转让给他人，如果开发者不同意金桐公司的该转让，则有权停止使用本协议下服务。如果开发者和平台用户继续使用，则视为开发者和平台用户对此转让予以接受。
    </p>
    <p>
        3.7 开发者违反平台使用规则时，金桐公司有权依照金桐的认识判断决定并采取以下行动，包括但不限于：限制应用或服务、下线应用或服务、封闭应用或服务、封闭开发者及其应用或服务接入金桐开放平台的接口，终止与开发者的服务协议关系，以及其他金桐公司认为适合的处理方式。
    </p>
    <p>
        3.8 金桐公司可通过网页公告、电子邮件、手机短信或常规的信件传送等方式向开发者发出通知，该等通知在发送时即视为已送达收件人。
    </p>

    <h3>知识产权条款</h3>

    <p>
        4.1 金桐开放平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由金桐公司或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。非经金桐公司或其他权利人书面同意任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表金桐开放平台上的网站程序或内容。
    </p>
    <p>
        4.2 开发者应用或服务发布前，开发者需向金桐公司提供能够证明开发者对应用或服务享有相关版权或同等权利的证明材料，以及开发者依法或根据金桐公司要求应向金桐公司提交的其他合法资质证明，否则，金桐公司有权决定对开发者应用或服务不予上线。
    </p>
    <p>
        开发者应金桐公司要求应当提供前述证明材料或资料的书面文件。如开发者在应用或服务中使用他人的知识产权、肖像、素材，需同时提供他人的合法授权证明。开发者须承担因相关证件不准确、不真实、不及时和不完整而产生的一切责任。如开发者不提供上述相关证明，则金桐公司有权延缓应用或服务的上线时间或单方终止服务关系。如因开发者侵害到他人权益并给其造成损失，则开发者应承担全部责任；如侵害到金桐公司权益并给金桐公司造成损失，则开发者须足额赔偿其遭受的一切损失。
    </p>
    <p>
        4.3 开发者应在其应用或服务中向相关权利人提供知识产权投诉途径，确保权利人可以向开发者主张权利。
    </p>

    <h3>隐私相关条款</h3>

    <p>
        5.1 金桐公司重视对开发者及平台用户隐私的保护，保护隐私是金桐公司的一项基本政策。您提供的登记资料及金桐公司保留的有关的若干其他个人资料将受到中国有关隐私的法律和金桐公司《隐私保护声明》等规范的保护。
    </p>
    <p>
        5.2 金桐公司不允许任何人在未经用户同意的情况利用金桐公司提供的服务以任何手段收集、编辑、出售或者无偿传播开发者和平台用户的隐私信息。一经发现开发者实施上述行为，金桐公司有权立即终止与该开发者的服务协议，终止为其提供任何服务，并有权追究其法律责任。
    </p>
    <p>
        5.3 如发生下列任一情况，金桐公司有权对开发者的信息予以披露：
    </p>
    <p>
        （1）经开发者本人同意披露的；
    </p>
    <p>
        （2）根据法律的有关规定，应相关第三人、行政机构或司法机构的要求，需要向其披露的；
    </p>
    <p>
        （3）开发者出现违反中国有关法律、法规、规章、政策的情形，需要向他人披露的；
    </p>
    <p>
        （4）金桐公司基于为开发者和平台用户服务的目的而认为合适披露的其他情形；
    </p>
    <p>
        （5）平台用户同意在其使用开发者提供的应用或服务过程中自行导入的与开发者应用或服务功能相关的数据，可能将由开发者自动接收并记录。金桐公司并不记录或控制平台用户的上述数据，也不对上述数据的安全性、合法性负责。
    </p>

    <h3>服务暂停或终止</h3>

    <p>
        6.1 开发者应确保自身在注册时填写的姓名（名称）、地址、电子邮箱等相关资料真实、准确，若有更新的，开发者应在三个工作日内予以更新，如金桐公司发现其不真实或不准确的，金桐公司有权暂停或终止向其提供本协议下服务,由此产生的一切法律责任由开发者自行承担。
    </p>
    <p>
        6.2 如开发者书面通知金桐公司不接受经金桐公司修改的新的服务协议的，金桐公司有权随时暂停或终止向其提供本协议下服务。
    </p>
    <p>
        6.3 本协议约定的其他协议终止条件发生或实现的，金桐公司有权随时暂停或终止向开发者提供本协议下服务。
    </p>
    <p>
        6.4 在开发者违反本协议规定时，金桐公司有权随时暂停或终止向该开发者提供部分或全部开放平台服务。如该开发者后续再直接或间接或以他人名义注册并登录金桐开放平台的，金桐公司有权直接单方面暂停或终止提供本协议下服务。
    </p>
    <p>
        6.5 在合作期限内，因不可抗力因素导致授权程序无法继续运营的，双方可协商终止协议。
    </p>
    <p>
        6.6 如本协议服务终止，金桐公司有权保留或删除开发者账号中的任何信息，且有权拒绝将该信息发还给开发者，也有权保存或删除开发者的全部相关数据，包括服务终止前开发者尚未完成的任何数据。
    </p>
    <p>
        6.7 在开发者存在违反法律法规或国家相关政策规定时，金桐公司有权随时暂停或终止向该开发者提供部分或全部开放平台服务。如该开发者后续再直接或间接（如以他人名义）注册并登录金桐开放平台的，金桐公司有权直接单方面暂停或终止提供本协议下服务。
    </p>
    <p>
        6.8 开发者限制、暂停或终止向用户提供任何应用或任何服务的，应当事先通知金桐及相关用户，需要对用户进行赔偿或补偿的，开发者应当主动承担赔偿或补偿义务。
    </p>
    <p>
        6.9 开发者应用在金桐平台发布后，金桐公司有权根据金桐平台的整体运营情况或相关运营规范、规则等随时调整开发者应用或服务运营的金桐平台，或随时中止、终止应用在金桐平台的运营及相关服务的提供等，若造成开发者有任何损失的，由开发者自行承担，开发者无权向金桐主张，对此开发者无异议。
    </p>

    <h3>协议内容修改</h3>

    <p>
        7.1 本协议内容包括协议正文及所有金桐公司已经发布的或将来可能发布的金桐开放平台相关规则。上述规则为本协议不可分割的一部分，与本协议正文具有同等法律效力。
    </p>
    <p>
        7.2 金桐公司有权根据需要不时地制订、修改本协议或各类规则，且毋须另行通知。其一旦发生变动，金桐公司将会在相关页面上公布修改后的协议或规则，如果开发者不同意所改动的内容，应主动取消服务，如果继续使用服务，则视为接受协议或规则的变动。除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本协议约束。
    </p>

    <h3>免责事由</h3>

    <p>
        8.1 鉴于网络服务的特殊性，开发者同意金桐公司会变更、中断部分或全部的网络服务，并按本协议规定删除开发者在使用“服务”中提交的任何资料，而无需通知开发者，也无需承担任何责任。
    </p>
    <p>
        8.2 金桐公司有权定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务在一定时间内的中断或暂停，金桐公司无需为此承担任何责任。
    </p>
    <p>
        8.3 如发生下述任一情况而导致服务中断及开发者损失的，金桐公司不承担责任：
    </p>
    <p>
        （1）发生不可抗力情形的；
    </p>
    <p>
        （2）黑客攻击、计算机病毒侵入或发作的；
    </p>
    <p>
        （3）计算机系统遭到破坏、瘫痪或无法正常使用的；
    </p>
    <p>
        （4）电信部门技术调整的；
    </p>
    <p>
        （5）因政府管制而造成暂时性关闭的；
    </p>
    <p>
        （6）其它非因金桐公司的过错而引起的。
    </p>

    <h3>本协议的解释、法律适用及争端解决</h3>

    <p>
        9.1 本协议为金桐网站规则的组成部分，若您对本协议的理解和执行有任何疑惑或争议的，可提请站方予以解释或处理。
    </p>
    <p>
        9.2 本协议的有效性、履行和与本协议及其修订本效力有关的所有事宜，将受中华人民共和国大陆法律管辖，任何争议仅适用中华人民共和国大陆法律。
    </p>
    <p>
        9.3 本协议签订地为中国北京市朝阳区。因本协议所引起的与金桐公司的任何纠纷或争议，协议各方首先应友好协商解决，协商不成的，各方在此完全同意将纠纷或争议提交金桐公司所在地即北京市朝阳区人民法院诉讼解决。
    </p>
    <p>
</div>
<?php $__env->stopSection(); ?>
<?php echo $__env->make('_layout.doc', array_except(get_defined_vars(), array('__data', '__path')))->render(); ?>